[detect_win_sysmon_t1218.011_rundll32_unusual_parent]
disabled = 0
cron_schedule = */5 * * * *
dispatch.earliest_time = -10m@m
dispatch.latest_time = -1m@m
search = `sysmon_process_creation` process_name="rundll32.exe" | eval parent_name = mvindex(split(ParentImage,"\\"),-1) | where NOT match(parent_name,"(?i)^(explorer|services|svchost|taskhost|wininit|userinit|sihost)\.exe$") | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(CommandLine) as commandlines values(parent_process_name) as parent_process_names by dest user process_name process_guid | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = medium
action.summary_index.attack_technique = T1218.011
action.summary_index.detection_id = win_sysmon_t1218.011_rundll32_unusual_parent
alert.suppress = 1
alert.suppress.period = 1h
alert.suppress.fields = dest, process_guid
alert.track = 1
