[detect_win_sysmon_t1059_001_powershell_encoded]
disabled = 0
cron_schedule = */5 * * * *
dispatch.earliest_time = -10m@m
dispatch.latest_time = -1m@m
search = `sysmon_process_creation` (Image="*\\powershell.exe" OR Image="*\\pwsh.exe") | where match(CommandLine, "(?i)\\s-(e|ec|en|enc|enco|encod|encode|encoded|encodedc|encodedco|encodedcom|encodedcomm|encodedcomma|encodedcomman|encodedcommand)\\s") | eval encoded_blob = mvindex(split(CommandLine, " "), -1) | eval blob_len = len(encoded_blob) | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(CommandLine) as commandlines values(parent_process_name) as parents values(blob_len) as blob_lengths by dest user process_name process_guid
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = high
action.summary_index.attack_technique = T1059.001
action.summary_index.detection_id = win_sysmon_t1059.001_powershell_encoded
action.summary_index.risk_score = 60
alert.suppress = 1
alert.suppress.period = 30m
alert.suppress.fields = dest, process_guid

[detect_win_sysmon_t1059_001_powershell_download_cradle]
disabled = 0
cron_schedule = */5 * * * *
dispatch.earliest_time = -10m@m
dispatch.latest_time = -1m@m
search = `sysmon_process_creation` (Image="*\\powershell.exe" OR Image="*\\pwsh.exe") | where match(CommandLine, "(?i)(iex|invoke-expression)") AND match(CommandLine, "(?i)(downloadstring|downloadfile|invoke-webrequest|iwr\\s|net\\.webclient|start-bitstransfer)") | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(CommandLine) as commandlines values(parent_process_name) as parents by dest user process_name process_guid
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = high
action.summary_index.attack_technique = T1059.001
action.summary_index.detection_id = win_sysmon_t1059.001_powershell_download_cradle
action.summary_index.risk_score = 70
alert.suppress = 1
alert.suppress.period = 1h
alert.suppress.fields = dest, process_guid

[detect_win_pwsh_t1059_001_amsi_bypass]
disabled = 0
cron_schedule = */5 * * * *
dispatch.earliest_time = -10m@m
dispatch.latest_time = -1m@m
search = `wineventlog_powershell_operational` EventID=4104 | where match(Message, "(?i)AmsiUtils|amsiInitFailed|amsi\\.dll|System\\.Management\\.Automation\\.AmsiUtils") | stats count min(_time) as firstTime max(_time) as lastTime values(Message) as script_blocks by host
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = high
action.summary_index.attack_technique = T1059.001
action.summary_index.detection_id = win_pwsh_t1059.001_amsi_bypass
action.summary_index.risk_score = 75
alert.suppress = 1
alert.suppress.period = 1h
alert.suppress.fields = host

[detect_win_sysmon_t1059_003_cmd_obfuscation]
disabled = 0
cron_schedule = */10 * * * *
dispatch.earliest_time = -15m@m
dispatch.latest_time = -1m@m
search = `sysmon_process_creation` Image="*\\cmd.exe" | eval caret_count = mvcount(split(CommandLine, "^")) - 1 | where caret_count >= 3 | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(CommandLine) as commandlines values(parent_process_name) as parents max(caret_count) as max_carets by dest user process_name process_guid
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = medium
action.summary_index.attack_technique = T1059.003
action.summary_index.detection_id = win_sysmon_t1059.003_cmd_obfuscation
action.summary_index.risk_score = 50
alert.suppress = 1
alert.suppress.period = 1h
alert.suppress.fields = dest, process_guid

[detect_win_sysmon_t1547_001_run_key_modification]
disabled = 0
cron_schedule = */10 * * * *
dispatch.earliest_time = -15m@m
dispatch.latest_time = -1m@m
search = `sysmon_registry_event` EventID=13 (TargetObject="*\\Software\\Microsoft\\Windows\\CurrentVersion\\Run*" OR TargetObject="*\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce*") | eval writer = mvindex(split(Image,"\\"), -1) | where NOT match(writer, "(?i)^(msiexec|setup|installer|trustedinstaller|wuauclt|svchost)\\.exe$") | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(TargetObject) as run_keys values(Details) as run_values values(writer) as writers by dest user process_guid
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = medium
action.summary_index.attack_technique = T1547.001
action.summary_index.detection_id = win_sysmon_t1547.001_run_key_modification
action.summary_index.risk_score = 55
alert.suppress = 1
alert.suppress.period = 6h
alert.suppress.fields = dest, process_guid, TargetObject

[detect_win_sysmon_t1053_005_scheduled_task_creation]
disabled = 0
cron_schedule = */10 * * * *
dispatch.earliest_time = -15m@m
dispatch.latest_time = -1m@m
search = `sysmon_process_creation` Image="*\\schtasks.exe" | where match(CommandLine, "(?i)\\s/(create|change)\\b") AND (match(CommandLine, "(?i)/ru\\s+system") OR match(CommandLine, "(?i)/tr\\s+.+(powershell|cmd\\.exe|wscript|cscript|mshta|rundll32|regsvr32)") OR match(CommandLine, "(?i)/sc\\s+(onlogon|onstart|once|minute)")) | eval parent_name = mvindex(split(ParentImage,"\\"), -1) | where NOT match(parent_name, "(?i)^(mmc|taskschd|trustedinstaller|msiexec|setup)\\.exe$") | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(CommandLine) as commandlines values(parent_process_name) as parents by dest user process_name process_guid
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = medium
action.summary_index.attack_technique = T1053.005
action.summary_index.detection_id = win_sysmon_t1053.005_scheduled_task_creation
action.summary_index.risk_score = 55
alert.suppress = 1
alert.suppress.period = 6h
alert.suppress.fields = dest, parent_process_name

[detect_win_secevt_t1136_001_local_account_creation]
disabled = 0
cron_schedule = */15 * * * *
dispatch.earliest_time = -20m@m
dispatch.latest_time = -1m@m
search = `wineventlog_security` EventID=4720 | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(TargetUserName) as new_account values(SubjectUserName) as creator by dest
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = medium
action.summary_index.attack_technique = T1136.001
action.summary_index.detection_id = win_secevt_t1136.001_local_account_creation
action.summary_index.risk_score = 55

[detect_win_sysmon_t1112_registry_persistence_helper]
disabled = 0
cron_schedule = */10 * * * *
dispatch.earliest_time = -15m@m
dispatch.latest_time = -1m@m
search = `sysmon_registry_event` EventID=13 (TargetObject="*\\Image File Execution Options\\*\\Debugger*" OR TargetObject="*\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Userinit*" OR TargetObject="*\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Shell*" OR TargetObject="*\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\AppInit_DLLs*" OR TargetObject="*\\Active Setup\\Installed Components\\*\\StubPath*") | eval writer = mvindex(split(Image,"\\"), -1) | where NOT match(writer, "(?i)^(TrustedInstaller|msiexec|setup|wuauclt|svchost)\\.exe$") | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(TargetObject) as registry_keys values(Details) as registry_values values(writer) as writers by dest user process_guid
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = high
action.summary_index.attack_technique = T1546.012
action.summary_index.detection_id = win_sysmon_t1112_registry_persistence_helper
action.summary_index.risk_score = 70

[detect_win_sysmon_t1218_011_rundll32_unusual_parent]
disabled = 0
cron_schedule = */5 * * * *
dispatch.earliest_time = -10m@m
dispatch.latest_time = -1m@m
search = `sysmon_process_creation` Image="*\\rundll32.exe" | eval parent_name = mvindex(split(ParentImage,"\\"), -1) | where NOT match(parent_name, "(?i)^(explorer|services|svchost|taskhost|wininit|userinit|sihost|searchindexer)\\.exe$") OR NOT match(CommandLine, "(?i)\\.dll") OR match(CommandLine, "(?i)javascript:|mshtml.*RunHTMLApplication") | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(CommandLine) as commandlines values(parent_process_name) as parents by dest user process_name process_guid
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = high
action.summary_index.attack_technique = T1218.011
action.summary_index.detection_id = win_sysmon_t1218.011_rundll32_unusual_parent
action.summary_index.risk_score = 65
alert.suppress = 1
alert.suppress.period = 1h
alert.suppress.fields = dest, parent_process_name

[detect_win_sysmon_t1218_005_mshta_execution]
disabled = 0
cron_schedule = */5 * * * *
dispatch.earliest_time = -10m@m
dispatch.latest_time = -1m@m
search = `sysmon_process_creation` Image="*\\mshta.exe" | where match(CommandLine, "(?i)https?://|javascript:|vbscript:|about:|\\.hta\\b") | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(CommandLine) as commandlines values(parent_process_name) as parents by dest user process_name process_guid
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = high
action.summary_index.attack_technique = T1218.005
action.summary_index.detection_id = win_sysmon_t1218.005_mshta_execution
action.summary_index.risk_score = 65

[detect_win_sysmon_t1218_010_regsvr32_remote]
disabled = 0
cron_schedule = */5 * * * *
dispatch.earliest_time = -10m@m
dispatch.latest_time = -1m@m
search = `sysmon_process_creation` Image="*\\regsvr32.exe" | where match(CommandLine, "(?i)https?://|/i:.+\\\\.+|scrobj\\.dll") | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(CommandLine) as commandlines values(parent_process_name) as parents by dest user process_name process_guid
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = high
action.summary_index.attack_technique = T1218.010
action.summary_index.detection_id = win_sysmon_t1218.010_regsvr32_remote
action.summary_index.risk_score = 70

[detect_win_sysmon_t1027_obfuscated_powershell_entropy]
disabled = 0
cron_schedule = */15 * * * *
dispatch.earliest_time = -20m@m
dispatch.latest_time = -1m@m
search = `sysmon_process_creation` (Image="*\\powershell.exe" OR Image="*\\pwsh.exe") | eval cmd_len = len(CommandLine) | eval weird_chars = mvcount(split(CommandLine, "`"))-1 + mvcount(split(CommandLine, "+"))-1 + mvcount(split(CommandLine, "$"))-1 + mvcount(split(CommandLine, "{"))-1 + mvcount(split(CommandLine, "}"))-1 | eval weird_ratio = round((weird_chars / cmd_len) * 100, 2) | where cmd_len > 200 AND weird_ratio > 8 | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(CommandLine) as commandlines max(cmd_len) as cmd_length max(weird_ratio) as weirdness_pct by dest user process_name process_guid
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = medium
action.summary_index.attack_technique = T1027
action.summary_index.detection_id = win_sysmon_t1027_obfuscated_powershell_entropy
action.summary_index.risk_score = 50

[detect_win_sysmon_t1140_certutil_decode]
disabled = 0
cron_schedule = */10 * * * *
dispatch.earliest_time = -15m@m
dispatch.latest_time = -1m@m
search = `sysmon_process_creation` Image="*\\certutil.exe" | where match(CommandLine, "(?i)\\s-(decode|decodehex|encode|encodehex|urlcache)\\b") OR match(CommandLine, "(?i)\\s-split\\s+-f\\s+https?://") | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(CommandLine) as commandlines values(parent_process_name) as parents by dest user process_name process_guid
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = medium
action.summary_index.attack_technique = T1140
action.summary_index.detection_id = win_sysmon_t1140_certutil_decode
action.summary_index.risk_score = 60

[detect_win_sysmon_t1562_001_defender_tamper]
disabled = 0
cron_schedule = */5 * * * *
dispatch.earliest_time = -10m@m
dispatch.latest_time = -1m@m
search = ((`sysmon_process_creation` (Image="*\\powershell.exe" OR Image="*\\pwsh.exe") CommandLine="*MpPreference*" (CommandLine="*-DisableRealtimeMonitoring*" OR CommandLine="*-ExclusionPath*" OR CommandLine="*-ExclusionProcess*" OR CommandLine="*-ExclusionExtension*")) OR (`sysmon_registry_event` EventID=13 (TargetObject="*\\SOFTWARE\\Policies\\Microsoft\\Windows Defender\\*" OR TargetObject="*\\SOFTWARE\\Microsoft\\Windows Defender\\Exclusions\\*"))) | eval action_type = if(EventID==1, "powershell_cmd", "registry_write") | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(CommandLine) as commandlines values(TargetObject) as registry_keys values(action_type) as actions by dest user process_guid
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = high
action.summary_index.attack_technique = T1562.001
action.summary_index.detection_id = win_sysmon_t1562.001_defender_tamper
action.summary_index.risk_score = 75

[detect_win_sysmon_t1222_001_icacls_permissive]
disabled = 0
cron_schedule = */15 * * * *
dispatch.earliest_time = -20m@m
dispatch.latest_time = -1m@m
search = `sysmon_process_creation` Image="*\\icacls.exe" | where match(CommandLine, "(?i)/grant.*\\b(everyone|users|authenticated\\s*users|domain\\s*users):\\s*\\(?[FM]\\)?") OR match(CommandLine, "(?i)/grant.*\\bs-1-1-0:") | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(CommandLine) as commandlines values(parent_process_name) as parents by dest user process_name process_guid
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = medium
action.summary_index.attack_technique = T1222.001
action.summary_index.detection_id = win_sysmon_t1222.001_icacls_permissive
action.summary_index.risk_score = 45

[detect_win_sysmon_t1003_001_lsass_access_suspicious]
disabled = 0
cron_schedule = */5 * * * *
dispatch.earliest_time = -10m@m
dispatch.latest_time = -1m@m
search = `sysmon_process_access` EventID=10 TargetImage="*\\lsass.exe" | eval source_name = mvindex(split(SourceImage,"\\"), -1) | where NOT match(source_name, "(?i)^(MsMpEng|MsSense|csrss|wininit|svchost|lsass|services|TaskMgr|VsTskMgr|SgrmBroker)\\.exe$") AND match(GrantedAccess, "(?i)^0x(1010|1410|1438|143a|1fffff)$") | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(SourceImage) as source_images values(GrantedAccess) as access_masks values(CallTrace) as call_traces by dest user SourceProcessGUID
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = critical
action.summary_index.attack_technique = T1003.001
action.summary_index.detection_id = win_sysmon_t1003.001_lsass_access_suspicious
action.summary_index.risk_score = 90

[detect_win_secevt_t1110_001_failed_logon_burst]
disabled = 0
cron_schedule = */5 * * * *
dispatch.earliest_time = -15m@m
dispatch.latest_time = -1m@m
search = `wineventlog_security` EventID=4625 | bucket _time span=15m | stats count dc(TargetUserName) as users_targeted values(TargetUserName) as users values(IpAddress) as src_ips values(LogonType) as logon_types by _time host | where (count >= 10 AND users_targeted == 1) OR (users_targeted >= 5) | eval pattern = case(users_targeted == 1, "brute_force_single_user", users_targeted >= 5, "password_spray", 1==1, "other")
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = medium
action.summary_index.attack_technique = T1110.001
action.summary_index.detection_id = win_secevt_t1110.001_failed_logon_burst
action.summary_index.risk_score = 50

[detect_win_sysmon_t1105_curl_wget_download]
disabled = 0
cron_schedule = */5 * * * *
dispatch.earliest_time = -10m@m
dispatch.latest_time = -1m@m
search = `sysmon_process_creation` (Image="*\\curl.exe" OR Image="*\\bitsadmin.exe") | where match(CommandLine, "(?i)https?://") AND NOT match(CommandLine, "(?i)https?://(127\\.|localhost|10\\.|172\\.(1[6-9]|2[0-9]|3[01])\\.|192\\.168\\.)") | `cim_endpoint_processes_rename` | stats count min(_time) as firstTime max(_time) as lastTime values(CommandLine) as commandlines values(parent_process_name) as parents by dest user process_name process_guid
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.severity = medium
action.summary_index.attack_technique = T1105
action.summary_index.detection_id = win_sysmon_t1105_curl_wget_download
action.summary_index.risk_score = 50
alert.suppress = 1
alert.suppress.period = 1h
alert.suppress.fields = dest, process_guid
