index=windows OR index=sysmon
| stats count by index, sourcetype

index=sysmon
| stats count by sourcetype

index=sysmon
| stats count by EventCode
| sort - count

index=windows EventCode=4624
| stats count by host, Account_Name, LogonType

index=windows EventCode=7045
| table _time host Service_Name ImagePath StartType Account_Name
| sort - _time
