[sysmon_process_creation]
definition = index=sysmon source="WinEventLog:Microsoft-Windows-Sysmon/Operational" OR sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=1
iseval = 0

[sysmon_network_connection]
definition = index=sysmon source="WinEventLog:Microsoft-Windows-Sysmon/Operational" OR sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=3
iseval = 0

[sysmon_image_load]
definition = index=sysmon source="WinEventLog:Microsoft-Windows-Sysmon/Operational" OR sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=7
iseval = 0

[sysmon_process_terminated]
definition = index=sysmon source="WinEventLog:Microsoft-Windows-Sysmon/Operational" OR sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=5
iseval = 0

[sysmon_file_create]
definition = index=sysmon source="WinEventLog:Microsoft-Windows-Sysmon/Operational" OR sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=11
iseval = 0

[sysmon_registry_event]
definition = index=sysmon source="WinEventLog:Microsoft-Windows-Sysmon/Operational" OR sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" (EventCode=12 OR EventCode=13 OR EventCode=14)
iseval = 0

[sysmon_pipe_event]
definition = index=sysmon source="WinEventLog:Microsoft-Windows-Sysmon/Operational" OR sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" (EventCode=17 OR EventCode=18)
iseval = 0

[sysmon_dns_query]
definition = index=sysmon source="WinEventLog:Microsoft-Windows-Sysmon/Operational" OR sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational" EventCode=22
iseval = 0

[wineventlog_security]
definition = index=windows sourcetype="XmlWinEventLog:Security"
iseval = 0

[wineventlog_powershell_operational]
definition = index=windows sourcetype="XmlWinEventLog:Microsoft-Windows-PowerShell/Operational"
iseval = 0

[wineventlog_system]
definition = index=windows sourcetype="XmlWinEventLog:System"
iseval = 0

[cim_endpoint_indexes]
definition = (index=sysmon OR index=windows)
iseval = 0

[cim_endpoint_processes_rename]
definition = rename Image as process, ProcessGuid as process_guid, ProcessId as process_id, ParentImage as parent_process, ParentProcessGuid as parent_process_guid, ParentCommandLine as parent_process_cmdline, User as user, host as dest | eval process_name = mvindex(split(process,"\\"),-1) | eval parent_process_name = mvindex(split(parent_process,"\\"),-1)
iseval = 0

[security_content_ctime(1)]
args = field
definition = eval $field$=strftime($field$,"%Y-%m-%dT%H:%M:%S")
iseval = 0

[risk_index]
definition = index=risk
iseval = 0

[suppress_24h(2)]
args = entity, signature
definition = eventstats max(_time) as last_seen by $entity$, $signature$ | where _time >= relative_time(last_seen, "-24h@h")
iseval = 0
